---
kind: type
id: T:Autodesk.Revit.DB.ParameterMapIterator
source: html/860070bc-dd1a-8e06-0043-7a013c0cab29.htm
---
# Autodesk.Revit.DB.ParameterMapIterator

An iterator to a map relating a parameter name (the key, a String) to a parameter.

## Syntax (C#)
```csharp
public abstract class ParameterMapIterator : APIObject,
	IEnumerator
```